tsung/tsung_output/scale-16/signup.xml
<?xml version="1.0"?><tsung loglevel="notice">

  <clients>
    <client host="localhost" use_controller_vm="true" maxusers="15000"/>
  </clients>

  <servers>
    <server host="linksin-2-t3-micro-scale-16.us-west-2.elasticbeanstalk.com" port="80" type="tcp"/>
  </servers>


  <load>
    <arrivalphase phase="1" duration="60" unit="second">
      <users arrivalrate="1" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="2" duration="60" unit="second">
      <users arrivalrate="1.5" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="3" duration="60" unit="second">
      <users arrivalrate="2" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="4" duration="60" unit="second">
      <users arrivalrate="4" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="5" duration="60" unit="second">
      <users arrivalrate="6" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="6" duration="60" unit="second">
      <users arrivalrate="10" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="7" duration="60" unit="second">
      <users arrivalrate="16" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="8" duration="60" unit="second">
      <users arrivalrate="20" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="9" duration="60" unit="second">
      <users arrivalrate="25" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="10" duration="60" unit="second">
      <users arrivalrate="35" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="11" duration="60" unit="second">
      <users arrivalrate="45" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="12" duration="60" unit="second">
      <users arrivalrate="55" unit="second"/>
    </arrivalphase>
  </load>

  <options>
    <option name="global_ack_timeout" value="2000"/>

    <option type="ts_http" name="user_agent">
      <user_agent probability="100">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
    </option>

    <option name="file_server" id="userlist" value="userlist.csv"/>
  </options>

  <sessions>
    <session name="crit_path_test" probability="100" type="ts_http">
      <setdynvars sourcetype="file" fileid="userlist" delimiter=";" order="iter">
          <var name="user_id"/>
          <var name="user_name"/>
          <var name="user_email"/>
      </setdynvars>

       <request>
        <http url="/" version="1.1" method="GET">
          <http_header name="Accept-Encoding" value="gzip, deflate"/>
        </http>
      </request>
      
      <thinktime value="10" random="true"/>

      <request subst="true">
        <dyn_variable name="authenticity_token"/>
        <http url="/signup" method="GET" version="1.1">
          <http_header name="Accept-Encoding" value="gzip, deflate"/>
        </http>
      </request>

      <thinktime random="true" min="5" max="10"/>

      <setdynvars sourcetype="eval" code="fun({Pid,DynVars})->                         {ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),                         http_uri:encode(Val) end.">
          <var name="encoded_authenticity_token"/>
      </setdynvars>
      <setdynvars sourcetype="eval" code="fun({Pid,DynVars})->                         {ok,Val}=ts_dynvars:lookup(user_name,DynVars),                         http_uri:encode(Val) end.">
          <var name="encoded_user_name"/>
      </setdynvars>
      <setdynvars sourcetype="eval" code="fun({Pid,DynVars})->                         {ok,Val}=ts_dynvars:lookup(user_email,DynVars),                         http_uri:encode(Val) end.">
          <var name="encoded_user_email"/>
      </setdynvars>

      <request subst="true">
        <dyn_variable name="redirect" re="Location: (http://.*)/edit\r"/>
        <http url="/signup" method="POST" version="1.1" contents="authenticity_token=%%_encoded_authenticity_token%%&amp;                                                                   user%5Bname%5D=%%_encoded_user_name%%&amp;                                                                   user%5Bemail%5D=%%_encoded_user_email%%&amp;                                                                   user%5Bpassword%5D=meow123&amp;                                                                   user%5Bpassword_confirmation%5D=meow123&amp;                                                                   commit=Create+Account" content_type="application/x-www-form-urlencoded">
          
          <http_header name="Accept-Encoding" value="gzip, deflate"/>
        </http>
      </request>
    </session>
  </sessions>
</tsung>